---
kind: method
id: M:Autodesk.Revit.DB.TableMergedCell.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)
source: html/b43d7bab-0752-0adf-39f7-b21a2cec9c28.htm
---
# Autodesk.Revit.DB.TableMergedCell.#ctor Method

Constructor.

## Syntax (C#)
```csharp
public TableMergedCell(
	int top,
	int left,
	int bottom,
	int right
)
```

## Parameters
- **top** (`System.Int32`) - Row index of the top-left of a table grid.
- **left** (`System.Int32`) - Column index of the top-left of a table grid.
- **bottom** (`System.Int32`) - Row index of the bottom-right of a table grid.
- **right** (`System.Int32`) - Column index of the bottom-right of a table grid.